
## :white_check_mark: Apply Succeeded (list-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/8002)



<pre><code>Apply complete! Resources: 9 added, 0 changed, 12 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B: Refreshing state... [id=PS6HIV0]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54: Refreshing state... [id=P4OKGQK]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC: Refreshing state... [id=P7L8H3N]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4: Refreshing state... [id=POXWHFA]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z0473210YV8ZG0O9C5XY]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8: Refreshing state... [id=ListAPI-Prod-CodePipeline]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949: Refreshing state... [id=ListAPI-Prod-CodePipelineRole]
aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C: Refreshing state... [id=ListAPI-Prod-CodePipelineRole:ListAPI-Prod-CodePipeline-Role-Policy]
aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2: Refreshing state... [id=/ecs/ListAPI-Prod/aws-otel-collector20221205232452338400000001]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
data.aws_kms_alias.kms_alias: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ListAPI-Prod/ecs/app]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=0a11e0c9-11d2-41ae-8572-fb37ee719488:ListAPI-Prod-ECS]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 1s [id=/Shared/PublicSubnets]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/87f87d3f-a6a3-4115-8214-b60ff0de36df]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=listapi-prod-app]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/ListAPI-Prod]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9: Refreshing state... [id=pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ListAPI-Prod-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ListAPI-Prod-TaskExecutionRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=895488803]
data.terraform_remote_state.incident_management: Read complete after 1s
data.aws_vpc.pocket-vpc_2587E211: Reading...
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_list-api.readitlater.com_NS]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=1735779153]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ListAPI-Prod-ECSCodeDeployRole]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/add90c251fbc8ce24938c7ee083001d39b532743]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=listapi-prod-app]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z0473210YV8ZG0O9C5XY__266755124b347d7fb2b103c57e10b4ad.list-api.readitlater.com._CNAME]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskRolePolicy]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PCEJOXZ]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PGR7P9M]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ListAPI-Prod-TaskExecutionRole-2021051718033181400000000a]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ListAPI-Prod-ECSCodeDeployRole-20210517180331622800000008]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ListAPI-Prod]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ListAPI-Prod-TaskRole-20210517180331752000000009]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ListAPI-Prod-TaskExecutionRole-2021051718033188520000000c]
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Refreshing state... [id=4245034133213406347]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=6b2649fd4ab18276cdde3aeb90e38ad1f1a807ed]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/LSTAPI20210517180330504500000003/f9f237aa4631b55a]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2022-04-17 04:23:30.273 +0000 UTC]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-06f55983caa3fb22b]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:1960b123-5622-4a4a-9202-8057a4a12dc3]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/LSTAPI20210517180330798400000006/00d747ba1046109d]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:2eee1689-5e51-4426-9727-fc00905e0bec]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0d41f0d58ada8d798]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/87fcc9c080c57013]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ListAPI-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z0473210YV8ZG0O9C5XY_list-api.readitlater.com_A_1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407/01d12b3e75bede46]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/ListAPI-Prod/ListAPI-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ListAPI-Prod/ListAPI-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ListAPI-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=8b8a2c44-f666-4981-8bb9-800ea7f82752]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ListAPI-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ListAPI-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ListAPI-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ListAPI-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.listapi_application_albcertificate_2023E490 has moved to aws_acm_certificate.application_alb_certificate_93966247
    resource "aws_acm_certificate" "application_alb_certificate_93966247" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/87f87d3f-a6a3-4115-8214-b60ff0de36df"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.listapi_application_albcertificate_certificatevalidation_3F8E0455 has moved to aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
    resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
        id                      = "2022-04-17 04:23:30.273 +0000 UTC"
        # (2 unchanged attributes hidden)
    }

  # aws_alb.listapi_application_applicationloadbalancer_alb_3DFD7FEC has moved to aws_alb.application_application_load_balancer_alb_05EA9801
    resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16"
        name                                        = "LSTAPI2021051718033188480000000b"
        tags                                        = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.listapi_application_listenerhttp_9FB57557 has moved to aws_alb_listener.application_listener_http_D74EC0ED
    resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/87fcc9c080c57013"
        tags              = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.listapi_application_listenerhttps_68D78D4C has moved to aws_alb_listener.application_listener_https_D31CB055
    resource "aws_alb_listener" "application_listener_https_D31CB055" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407"
        tags              = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.listapi_application_ecsservice_listenerrule_A08AAD77 has moved to aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
    resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407/01d12b3e75bede46"
        tags         = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.listapi_application_ecsservice_bluetargetgroup_ecstargetgroup_D3F21073 has moved to aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
    resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/LSTAPI20210517180330504500000003/f9f237aa4631b55a"
        name                               = "LSTAPI20210517180330504500000003"
        tags                               = {
            "environment" = "Prod"
            "service"     = "ListAPI"
            "type"        = "blue"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.listapi_application_ecsservice_greentargetgroup_ecstargetgroup_9168F472 has moved to aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
    resource "aws_alb_

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...


      - tags_all                    = {} -> null

      - grant {
          - id          = "92f1efb5501a01f6ebb8e3628131c3483688d3e5ca1a7c175420c565a06a6616" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_security_group.listapi_application_applicationloadbalancer_albsecuritygroup_1977B65E has moved to aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
    resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-06f55983caa3fb22b"
        name                   = "ListAPI-Prod-HTTP/S Security Group20210517180330682300000004"
        tags                   = {
            "Name"        = "ListAPI-Prod-HTTP/S Security Group"
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.listapi_application_ecsservice_ecssecuritygroup_F5081C30 has moved to aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
    resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-0d41f0d58ada8d798"
        name                   = "ListAPI-Prod-ECSSecurityGroup2021051718033192790000000d"
        tags                   = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic.listapi_pagerduty_alarmcriticaltopic_63004665 has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical"
        name                                     = "ListAPI-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.listapi_pagerduty_alarmnoncriticaltopic_113F0F31 has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "ListAPI-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.listapi_pagerduty_alarmcriticalsubscription_049DA033)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:2eee1689-5e51-4426-9727-fc00905e0bec" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/d52e1706e74a400cc06f850bffbce11d/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:2eee1689-5e51-4426-9727-fc00905e0bec" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.listapi_pagerduty_alarmnoncriticalsubscription_CB7F35B6)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:1960b123-5622-4a4a-9202-8057a4a12dc3" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/c4635e7108ca4d0dc07931cfcd54eeea/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:1960b123-5622-4a4a-9202-8057a4a12dc3" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  # (moved from local_file.listapi_application_ecsservice_appspec_5A331B8C)
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.application_ecs_service_create-task-definition-file_6BADBAF7 must be replaced
  # (moved from null_resource.listapi_application_ecsservice_createtaskdefinitionfile_E4E04DD8)
-/+ resource "null_resource" "application_ecs_service_create-task-definition-file_6BADBAF7" {
      ~ id       = "4245034133213406347" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "alwaysRun" = "2023-12-11T17:39:15Z" -> (known after apply)
        }
    }

  # pagerduty_service.listapi_pagerduty_pagerdutycritical_A80B75D9 has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "PGR7P9M"
        name                    = "ListAPI-Prod-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.listapi_pagerduty_pagerdutynoncritical_8B103450 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "PCEJOXZ"
        name                    = "ListAPI-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4 will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4 is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4" {
      - html_url        = "https://mozilla.pagerduty.com/services/PGR7P9M/integrations/POXWHFA" -> null
      - id              = "POXWHFA" -> null
      - integration_key = "d52e1706e74a400cc06f850bffbce11d" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PGR7P9M" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54 will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54 is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54" {
      - html_url        = "https://mozilla.pagerduty.com/services/PCEJOXZ/integrations/P4OKGQK" -> null
      - id              = "P4OKGQK" -> null
      - integration_key = "c4635e7108ca4d0dc07931cfcd54eeea" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PCEJOXZ" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B" {
      - html_url        = "https://mozilla.pagerduty.com/services/PGR7P9M/integrations/PS6HIV0" -> null
      - id              = "PS6HIV0" -> null
      - integration_key = "e3995ce53f70470dd06c042a67bfa6da" -> null
      - name            = "Sentry" -> null
      - service         = "PGR7P9M" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC" {
      - html_url        = "https://mozilla.pagerduty.com/services/PCEJOXZ/integrations/P7L8H3N" -> null
      - id              = "P7L8H3N" -> null
      - integration_key = "943753061c0c4600d0a8c4e5811e12b5" -> null
      - name            = "Sentry" -> null
      - service         = "PCEJOXZ" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PGR7P9M"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PCEJOXZ"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PGR7P9M"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PCEJOXZ"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 9 to add, 0 to change, 12 to destroy.
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Destroying... [id=4245034133213406347]
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Destruction complete after 0s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B: Destroying... [id=PS6HIV0]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC: Destroying... [id=P7L8H3N]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8: Destroying... [id=ListAPI-Prod-CodePipeline]
aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C: Destroying... [id=ListAPI-Prod-CodePipelineRole:ListAPI-Prod-CodePipeline-Role-Policy]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:2eee1689-5e51-4426-9727-fc00905e0bec]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:1960b123-5622-4a4a-9202-8057a4a12dc3]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ListAPI-Prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C: Destruction complete after 0s
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 1s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4: Destroying... [id=POXWHFA]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 1s
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54: Destroying... [id=P4OKGQK]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8: Destruction complete after 1s
aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9: Destroying... [id=pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 1s [id=ListAPI-Prod]
aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949: Destroying... [id=ListAPI-Prod-CodePipelineRole]
aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9: Destruction complete after 0s
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Creating...
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Provisioning with 'local-exec'...
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7 (local-exec): Executing: ["/bin/sh" "-c" "aws --region us-east-1 ecs describe-task-definition --task-definition ListAPI-Prod --query 'taskDefinition' >> taskdef.json"]
aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949: Destruction complete after 0s
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=40e918fc7e737a7b2856010386500f4cbd4ff883]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC: Destruction complete after 1s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B: Destruction complete after 1s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54: Destruction complete after 0s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4: Destruction complete after 0s
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=PWV94OW]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 1s [id=PA4X50J]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 1s [id=PSIL3Z6]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 0s [id=PP9A2JG]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Creation complete after 1s [id=3788510607762494902]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:6c7cb674-bd9b-424a-bc13-964a078887c9]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:08d4ae6a-9f88-4bf3-ab51-e5215fe2f425]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1971, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1971:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵

Apply complete! Resources: 9 added, 0 changed, 12 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"2529b9a8-d7c3-49a2-af19-b762868026d7","JobName":"list-api_infrastructure_apply_prod","PRNumber":40,"Program":"tfcmt","SHA1":"420f374f2925627230a32cff18b91690278907d8","Target":"list-api-cdk","Vars":{}} -->